# HelpType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContextualHelp..::..HelpType Property
ContextualHelp Class See Also
---
The contextual help type.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ContextualHelpType HelpType { get; set; }
```

Visual Basic
---
```text
Public Property HelpType As ContextualHelpType
	Get
	Set
```

Visual C++
---
```text
public:
property ContextualHelpType HelpType {
	ContextualHelpType get ();
	void set (ContextualHelpType value);
}
```

# See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace